
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДеньгиОстатки Расход
	Движения.ДеньгиОстатки.Записывать = Истина;
	Для Каждого ТекСтрокаСоставСписание Из СоставСписание Цикл
		Движение = Движения.ДеньгиОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.МестоХранения = ТекСтрокаСоставСписание.МестоХранения;
		Движение.Количество = ТекСтрокаСоставСписание.Количество;
	КонецЦикла;

	// регистр ДеньгиОстатки Приход
	Движения.ДеньгиОстатки.Записывать = Истина;
	Для Каждого ТекСтрокаСоставЗачисление Из СоставЗачисление Цикл
		Движение = Движения.ДеньгиОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.МестоХранения = ТекСтрокаСоставЗачисление.МестоХранения;
		Движение.Количество = ТекСтрокаСоставЗачисление.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
