

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    	//
	// регистр ДоходыОборот Приход
	Движения.ДоходыОборот.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТабличнаяЧасть Цикл
		Движение = Движения.ДоходыОборот.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектДохода = ТекСтрокаТабличнаяЧасть.Позиция;
		Движение.МестоХранения = ТекСтрокаТабличнаяЧасть.МестоХранения;
		Движение.Количество = ТекСтрокаТабличнаяЧасть.Средства;
	КонецЦикла;

	// регистр ДеньгиОстатки Приход
	Движения.ДеньгиОстатки.Записывать = Истина;
	
	ТЗНаЗаписьОстатки = СредстваРаботаСДокументами.СвернутьТабличнуюЧастьПоМестамХранения(ТабличнаяЧасть);	
	
	Для Каждого ТекСтрокаТабличнаяЧасть Из ТЗНаЗаписьОстатки Цикл
		Движение = Движения.ДеньгиОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.МестоХранения = ТекСтрокаТабличнаяЧасть.МестоХранения;
		Движение.Количество = ТекСтрокаТабличнаяЧасть.Средства;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	sss = 0;	
	
КонецПроцедуры

