
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьАктуальнымиДанными();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбщийОстатокСредств()	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДеньгиОстаткиОстатки.МестоХранения КАК МестоХранения,
	               |	ДеньгиОстаткиОстатки.КоличествоОстаток КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ДеньгиОстатки.Остатки КАК ДеньгиОстаткиОстатки";
	
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗРезультат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьАктуальнымиДанными()
	
	ТаблицаОстатокСредств.Загрузить(ПолучитьОбщийОстатокСредств());
	ИтогоСредств = ТаблицаОстатокСредств.Итог("Количество");

КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ЗаполнитьАктуальнымиДанными();
	
КонецПроцедуры
 